#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.template_file.env_vars: Reading...
data.template_file.env_vars: Read complete after 0s [id=73ba521a465d7f11bc5d9325dec9536fc1a54ab6e41e63fe5206fd17f60867a1]
data.aws_iam_policy_document.assume_role_policy: Reading...
aws_cloudwatch_log_group.log-group: Refreshing state... [id=tic-tac-toe-prod-logs]
aws_ecr_repository.aws-ecr: Refreshing state... [id=tic-tac-toe-prod-ecr]
aws_eip.nat: Refreshing state... [id=eipalloc-0ae71aeae0fd8214a]
aws_vpc.aws-vpc: Refreshing state... [id=vpc-0ee895eead62887ae]
aws_ecs_cluster.aws-ecs-cluster: Refreshing state... [id=arn:aws:ecs:ap-south-1:522814736852:cluster/tic-tac-toe-prod-cluster]
data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=1077804475]
aws_iam_role.ecsTaskExecutionRole: Refreshing state... [id=tic-tac-toe-execution-task-role]
aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=tic-tac-toe-execution-task-role-20250418115057863700000001]
aws_ecs_task_definition.aws-ecs-task: Refreshing state... [id=tic-tac-toe-task]
data.aws_ecs_task_definition.main: Reading...
data.aws_ecs_task_definition.main: Read complete after 0s [id=arn:aws:ecs:ap-south-1:522814736852:task-definition/tic-tac-toe-task:5]
aws_internet_gateway.aws-igw: Refreshing state... [id=igw-0d3c2d1f233a35844]
aws_subnet.private[1]: Refreshing state... [id=subnet-01eb835ec2503398a]
aws_security_group.load_balancer_security_group: Refreshing state... [id=sg-08c16cfee47aea445]
aws_subnet.private[0]: Refreshing state... [id=subnet-0b82ae4babe517337]
aws_route_table.private: Refreshing state... [id=rtb-03d7e91b57d28aec1]
aws_subnet.public[0]: Refreshing state... [id=subnet-00e70158f31bb577f]
aws_subnet.public[1]: Refreshing state... [id=subnet-0ca77593c3b639719]
aws_route_table.public: Refreshing state... [id=rtb-0ab8616b8a077d6ad]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:522814736852:targetgroup/tic-tac-toe-prod-tg/ae1547f09b17d29a]
aws_security_group.service_security_group: Refreshing state... [id=sg-0f612a252e6b74ce5]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05585c67c108078d7]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a14369743aec0155]
aws_route.public: Refreshing state... [id=r-rtb-0ab8616b8a077d6ad1080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-049368269725bbabb]
aws_nat_gateway.nat: Refreshing state... [id=nat-007b6d78bf1a0ad6f]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00ddea5581407d855]
aws_alb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:522814736852:loadbalancer/app/tic-tac-toe-prod-alb/1309432f72817d77]
aws_route.private: Refreshing state... [id=r-rtb-03d7e91b57d28aec11080289494]
aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:522814736852:listener/app/tic-tac-toe-prod-alb/1309432f72817d77/c0704e88b877d07a]
aws_ecs_service.aws-ecs-service: Refreshing state... [id=arn:aws:ecs:ap-south-1:522814736852:service/tic-tac-toe-prod-cluster/tic-tac-toe-prod-ecs-service]
aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/tic-tac-toe-prod-cluster/tic-tac-toe-prod-ecs-service]
aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=tic-tac-toe-prod-memory-autoscaling]
aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=tic-tac-toe-prod-cpu-autoscaling]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.alb_dns_record will be created
  + resource "aws_route53_record" "alb_dns_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ravicloudexper.online"
      + type            = "A"
      + zone_id         = "Z10071467DLAGMP0KJMM"

      + alias {
          + evaluate_target_health = true
          + name                   = "tic-tac-toe-prod-alb-1651365539.ap-south-1.elb.amazonaws.com"
          + zone_id                = "ZP97RAFLXTNZK"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ravisrma, Action: `pull_request`*